export const GREETING = 'Привет, я руководитель 1С,\n' +
  'я всегда помогу вам найти решить любую проблему.\n\n' +
  'я опытный эксперт в управлении разработкой програмных продуктов';

export const HELP = 'Привет, я руководитель 1С,\n' +
  'просто напишите мне, и я помогу решить ваши проблемы.';


export const TRIGGERS = [
  [/^пох(у[йи])?$/i, 'Прежде чем что либо делать, согласовать...'],
  [/^к[оа]роч[ье]?$/i, 'Что за вечная самодеятельность!'],
  //[/^ч[еоё]$/i, 'Задача должна быть сделана!'],
  [/^8[.3]$/i, 'Никаких изменений платформы!'],
  [/^платфор(ма|му|мы|ме|мой)$/i, 'Никаких изменений платформы!'],
  //[/^нет$/i, 'Что за вечная самодеятельность!'],
  //[/^да$/i, 'Нечего нарушать регламенты!!!'],
  [/^шин(а|у|ы)$/i, 'Нужно выбрать хорошую Шину, плохую Шину выбирать не нужно'],
  [/^архитектор(а|у|ы)$/i, 'Спросите у Малышева, он у нас архитектор'],
  [/^хо(чу|тим|тят|тел|тела)$/i, 'Не надо хотеть, надо делать!'],
  [/^зада(чу|чи|ч)$/i, 'Задача должна быть сделана!'],
  [/^рели(з|зы|зов)$/i, 'Перед обновлением снимите копию базы!!!'],
  [/^делать$/i, 'Прежде чем что либо делать, согласовать...'],
  [/^аналити(к|ка|ков|ки)$/i, 'Рассказывал Вам, как выкинул Аналитика в окно?!'],
  [/^мдлп$/i, 'Руднев решит вопрос...'],
  [/^гавн(о|ище|а|у)$/i, 'Как ты определил?'],
  [/^техдол(га|г)$/i, 'Где чек-лист?'],
  [/^муда(ки|к|ков)$/i, 'Пора наказывать!'],
  [/^спасибо$/i, 'Мне надоело об этом говорить!'],
  [/^рукопожимаю$/i, 'Взаимножму!'],
  [/^обнимаю$/i, 'Взаимнобнимаю!'],
  [/^(гит|git|едт|edt|тп|стп|отп)$/i, 'Пора наказывать мудаков!'],
  [/^(щеглов|галкин|марат|ста(с|са|су|сик|сика|сику)|сыпало|ссыкало|сссыкало|игоряш(а|у)|игорь|кококонстантин)$/i, 'Пора наказывать мудака!'],
  
];

export const ANSWER_TO_QUESTION = 'Решите вопрос!';


