export const GREETING = 'Привет, я Культурный Бот,\n' +
  'я всегда помогу вам найти достойный и вежливый ответ.\n\n' +
  'Просто напишите мне и я вам отвечу как гопник.';

export const HELP = 'Привет, я Культурный Бот,\n' +
  'просто напишите мне и я вам отвечу как гопник.';


export const TRIGGERS = [
  [/^пох(у[йи])?$/i, 'Прежде чем что либо делать, согласовать...'],
  [/^к[оа]роч[ье]?$/i, 'Что за вечная самодеятельность!'],
  [/^ч[еоё]$/i, 'Нечего нарушать регламенты!!!'],
  [/^300$/i, 'Никаких изменений платформы!'],
  [/^трист[ао]$/i, 'Никаких изменений платформы!'],
  [/^нет$/i, 'Что за вечная самодеятельность!'],
  [/^да$/i, 'Нечего нарушать регламенты!!!'],
  [/^хо(чу|тим|тят|тел|тела)$/i, 'Не надо хотеть, надо делать!'],
  [/^я$/i, 'рассказывал Вам, как Выкинул Аналитика в окно?!'],
];

export const ANSWER_TO_QUESTION = 'Решите вопрос!';



